Enums/DMS_ВариантыВажностиЗадачи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>DMS_ВариантыВажностиЗадачи</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Высокая</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обычная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Низкая</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СостоянияСобытий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>СостоянияСобытий</Name>
			<Comment>Состояния событий</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Запланировано</Name>
					<Comment>Запланировано</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выполняется</Name>
					<Comment>Выполняется</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отменено</Name>
					<Comment>Отменено</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Завершено</Name>
					<Comment>Завершено</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Утверждено</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/Renault_Задачи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>Renault_Задачи</Name>
			<BasedOn>
				<xr:Item>Document.ЭлектронноеПисьмо</xr:Item>
				<xr:Item>Document.Renault_Задачи</xr:Item>
				<xr:Item>Catalog.Контрагенты</xr:Item>
				<xr:Item>Document.АвансовыйОтчет</xr:Item>
				<xr:Item>Document.АктПриемаПередачиЦенныхБумаг</xr:Item>
				<xr:Item>Document.АктСверкиВзаиморасчетов</xr:Item>
				<xr:Item>Document.Амортизация</xr:Item>
				<xr:Item>Document.БюджетДДС</xr:Item>
				<xr:Item>Document.БюджетДоходовИРасходов</xr:Item>
				<xr:Item>Document.БюджетЗакупок</xr:Item>
				<xr:Item>Document.БюджетПродаж</xr:Item>
				<xr:Item>Document.ВводВЭксплуатацию</xr:Item>
				<xr:Item>Document.ВводОстатковВзаиморасчетов</xr:Item>
				<xr:Item>Document.ВводОстатковПрочихАктивов</xr:Item>
				<xr:Item>Document.ВводОстатковТоваров</xr:Item>
				<xr:Item>Document.Взаимозачет</xr:Item>
				<xr:Item>Document.ВозвратОтПокупателя</xr:Item>
				<xr:Item>Document.ВозвратПоставщику</xr:Item>
				<xr:Item>Document.Выписка</xr:Item>
				<xr:Item>Document.ВыплатаЗарплаты</xr:Item>
				<xr:Item>Document.ЗаказВнутренний</xr:Item>
				<xr:Item>Document.ЗаказПокупателя</xr:Item>
				<xr:Item>Document.ЗаказПоставщику</xr:Item>
				<xr:Item>Document.ЗакрытиеНакопительныхСумм</xr:Item>
				<xr:Item>Document.ЗакрытиеПериода</xr:Item>
				<xr:Item>Document.ИзменениеАссортиментаПодразделения</xr:Item>
				<xr:Item>Document.ЗакрытиеСмены</xr:Item>
				<xr:Item>Document.ИзменениеЦен</xr:Item>
				<xr:Item>Document.ИнвентаризацияОрдерногоСклада</xr:Item>
				<xr:Item>Document.Инвентаризация</xr:Item>
				<xr:Item>Document.Инкассация</xr:Item>
				<xr:Item>Document.Комплектация</xr:Item>
				<xr:Item>Document.КорректировкаДолга</xr:Item>
				<xr:Item>Document.Корректировка</xr:Item>
				<xr:Item>Document.КорректировкаЗаказаПокупателя</xr:Item>
				<xr:Item>Document.КорректировкаЗаказаПоставщику</xr:Item>
				<xr:Item>Document.НазначениеСкидокШапки</xr:Item>
				<xr:Item>Document.НазначениеСкидокСтроки</xr:Item>
				<xr:Item>Document.НачислениеЗарплаты</xr:Item>
				<xr:Item>Document.ОбслуживаниеАктива</xr:Item>
				<xr:Item>Document.ОтчетКомиссионера</xr:Item>
				<xr:Item>Document.ОтчетКомитенту</xr:Item>
				<xr:Item>Document.ПеремещениеАктивов</xr:Item>
				<xr:Item>Document.ПеремещениеДенежныхСредств</xr:Item>
				<xr:Item>Document.ПеремещениеТоваров</xr:Item>
				<xr:Item>Document.Переоценка</xr:Item>
				<xr:Item>Document.ПереоценкаВалютныхСредств</xr:Item>
				<xr:Item>Document.ПереразмещениеТоваров</xr:Item>
				<xr:Item>Document.ПересортицаТоваров</xr:Item>
				<xr:Item>Document.ПланФакт</xr:Item>
				<xr:Item>Document.ПлатежноеПоручение</xr:Item>
				<xr:Item>Document.ПоступлениеДопРасходов</xr:Item>
				<xr:Item>Document.ПоступлениеТоваров</xr:Item>
				<xr:Item>Document.ПриходныйКассовыйОрдер</xr:Item>
				<xr:Item>Document.ПриходныйСкладскойОрдер</xr:Item>
				<xr:Item>Document.Разукомплектация</xr:Item>
				<xr:Item>Document.РасходныйКассовыйОрдер</xr:Item>
				<xr:Item>Document.РасходныйСкладскойОрдер</xr:Item>
				<xr:Item>Document.РеализацияАктивов</xr:Item>
				<xr:Item>Document.СнятиеРезервовЗаказовПокупателя</xr:Item>
				<xr:Item>Document.РезервированиеЗаказовПокупателя</xr:Item>
				<xr:Item>Document.РеализацияТоваров</xr:Item>
				<xr:Item>Document.СписаниеАктивов</xr:Item>
				<xr:Item>Document.СписаниеТоваров</xr:Item>
				<xr:Item>Document.СчетНаОплату</xr:Item>
				<xr:Item>Document.СчетФактураВыданный</xr:Item>
				<xr:Item>Document.СчетФактураПолученный</xr:Item>
				<xr:Item>Document.Чек</xr:Item>
				<xr:Item>Document.ЧекНаОплату</xr:Item>
				<xr:Item>Document.АктРазногласий</xr:Item>
				<xr:Item>Document.БюджетОказанияУслугПоАвтоработам</xr:Item>
				<xr:Item>Document.ЗаказНаряд</xr:Item>
				<xr:Item>Document.ЗаявкаНаРемонт</xr:Item>
				<xr:Item>Document.ИзвлечениеТоваровИзПроизводства</xr:Item>
				<xr:Item>Document.ПеремещениеТоваровВПроизводство</xr:Item>
				<xr:Item>Document.РаспределениеЗаказаПокупателя</xr:Item>
				<xr:Item>Document.БюджетЗакупокАвтомобилей</xr:Item>
				<xr:Item>Document.БюджетПродажАвтомобилей</xr:Item>
				<xr:Item>Document.ВводВЭксплуатациюАвтомобилей</xr:Item>
				<xr:Item>Document.ВводОстатковАвтомобилей</xr:Item>
				<xr:Item>Document.ВозвратОтПокупателяАвтомобилей</xr:Item>
				<xr:Item>Document.ВозвратПоставщикуАвтомобилей</xr:Item>
				<xr:Item>Document.ЗаказНаАвтомобиль</xr:Item>
				<xr:Item>Document.ИзменениеЦенАвтомобилей</xr:Item>
				<xr:Item>Document.ИзменениеЦенОпций</xr:Item>
				<xr:Item>Document.ИнвентаризацияАвтомобилей</xr:Item>
				<xr:Item>Document.ОтчетКомиссионераЗаАвтомобили</xr:Item>
				<xr:Item>Document.ОтчетКомитентуЗаАвтомобили</xr:Item>
				<xr:Item>Document.ПеремещениеАвтомобилей</xr:Item>
				<xr:Item>Document.ПереоценкаАвтомобилей</xr:Item>
				<xr:Item>Document.РеализацияАвтомобилей</xr:Item>
				<xr:Item>Document.СнятиеРезервовАвтомобилей</xr:Item>
				<xr:Item>Document.СписаниеАвтомобилей</xr:Item>
				<xr:Item>Document.СчетНаОплатуЗаАвтомобили</xr:Item>
				<xr:Item>Document.ИзменениеЦенАвторабот</xr:Item>
				<xr:Item>Document.ПоступлениеАвтомобилей</xr:Item>
				<xr:Item>Document.ВводОстатковТоваровВПроизводстве</xr:Item>
				<xr:Item>Document.ПланПоступленияДС</xr:Item>
				<xr:Item>Document.СчетОтПоставщика</xr:Item>
				<xr:Item>Document.ЗаявкаНаРасходДС</xr:Item>
				<xr:Item>Document.ВводОстатковНакопительныхСумм</xr:Item>
				<xr:Item>Document.ЗаменаВЗаказеПокупателя</xr:Item>
				<xr:Item>Document.СнятиеРаспределенияЗаказовПокупателя</xr:Item>
				<xr:Item>Document.ПеремещениеНезавершенногоПроизводства</xr:Item>
				<xr:Item>Document.СчетОтПоставщикаЗаАвтомобили</xr:Item>
				<xr:Item>Document.РасходныйСкладскойОрдерНаАвтомобили</xr:Item>
				<xr:Item>Document.РазукомплектацияАвтомобилей</xr:Item>
				<xr:Item>Document.ПриходныйСкладскойОрдерНаАвтомобили</xr:Item>
				<xr:Item>Document.ПереразмещениеАвтомобилей</xr:Item>
				<xr:Item>Document.УРВ_Табель</xr:Item>
				<xr:Item>Document.ПеремещениеРезервов</xr:Item>
				<xr:Item>Document.ЗаказПоставщикуНаАвтомобиль</xr:Item>
				<xr:Item>Document.РезервированиеАвтомобилей</xr:Item>
				<xr:Item>Document.РабочийЛист</xr:Item>
				<xr:Item>Document.ЖалобаКлиента</xr:Item>
				<xr:Item>Document.СтраховойПолис</xr:Item>
				<xr:Item>Document.Рассылка</xr:Item>
				<xr:Item>Document.Опрос</xr:Item>
				<xr:Item>Document.ЗаменаВЗаказеПоставщику</xr:Item>
			</BasedOn>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Comment>Пользователь, создавший документ</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЗадачи</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Renault_ТипыЗадач</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Комментарий документа</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Приоритет</Name>
					<Comment>Приоритет</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.DMS_ВариантыВажностиЗадачи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Comment>Содержание</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаменаАвто</Name>
					<Comment>(задача для менеджера по продажам)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Пользователи</Name>
					<Comment>Список пользователей</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Пользователь</Name>
							<Comment>Пользователь</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СостояниеЗадачи</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СостоянияСобытий</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаНачалаПлан</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОкончанияПлан</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаНачала</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОкончания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Пояснение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

CommonModules/Renault_РаботаСЗадачами/Ext/Module.bsl
Процедура СоздатьЗадачуRenault(Параметры) Экспорт
	
	Задача = Документы.Renault_Задачи.СоздатьДокумент();
	Задача.Автор = Параметры.Автор;
	Задача.Дата = ТекущаяДата();
	Задача.ВидЗадачи = Параметры.ВидЗадачи;
	Задача.ДокументОснование = Параметры.ДокументОснование;
	
	Если Параметры.Приоритет = Неопределено Тогда
		Приоритет = Перечисления.DMS_ВариантыВажностиЗадачи.Обычная;
	КонецЕсли;
	
	Задача.Комментарий  = Параметры.Комментарий;
	Задача.Приоритет 	= Параметры.Приоритет;
	Задача.Содержание   = Параметры.Содержание;
	Если НЕ ЗначениеЗаполнено(Параметры.Исполнители) Тогда
		Возврат;
	ИначеЕсли ТипЗнч(Параметры.Исполнители) = Тип("СправочникСсылка.Пользователи") Тогда
		НовыйИсполнитель = Задача.Пользователи.Добавить();
		НовыйИсполнитель.Пользователь      = Параметры.Исполнители;
		НовыйИсполнитель.ДатаНачалаПлан    = Параметры.ДатаНачала;
		НовыйИсполнитель.ДатаОкончанияПлан = Параметры.ДатаОкончания;
		НовыйИсполнитель.СостояниеЗадачи   = Перечисления.СостоянияСобытий.Запланировано;
		СтрПояснение = "";
		Если Параметры.Свойство("Пояснение", СтрПояснение) Тогда
			НовыйИсполнитель.Пояснение = СтрПояснение;
		Иначе
			НовыйИсполнитель.Пояснение = Параметры.ВидЗадачи.Наименование;
		КонецЕсли;
	ИначеЕсли ТипЗнч(Параметры.Исполнители) = Тип("СправочникСсылка.Сотрудники") Тогда
		НовыйИсполнитель = Задача.Пользователи.Добавить();
		НовыйИсполнитель.Пользователь      = Renault_CRM.ПолучитьПользователяПоСотруднику(Параметры.Исполнители);
		НовыйИсполнитель.ДатаНачалаПлан    = Параметры.ДатаНачала;
		НовыйИсполнитель.ДатаОкончанияПлан = Параметры.ДатаОкончания;
		НовыйИсполнитель.СостояниеЗадачи   = Перечисления.СостоянияСобытий.Запланировано;
		СтрПояснение = "";
		Если Параметры.Свойство("Пояснение", СтрПояснение) Тогда
			НовыйИсполнитель.Пояснение = СтрПояснение;
		Иначе
			НовыйИсполнитель.Пояснение = Параметры.ВидЗадачи.Наименование;
		КонецЕсли;
	ИначеЕсли ТипЗнч(Параметры.Исполнители) = Тип("Массив") Тогда 
		Для Каждого Исполнитель из Параметры.Исполнители Цикл
			НовыйИсполнитель = Задача.Пользователи.Добавить();
			НовыйИсполнитель.Пользователь      = Исполнитель.Пользователь;
			НовыйИсполнитель.ДатаНачалаПлан    = Параметры.ДатаНачала;
			НовыйИсполнитель.ДатаОкончанияПлан = Параметры.ДатаОкончания;
			НовыйИсполнитель.СостояниеЗадачи   = Перечисления.СостоянияСобытий.Запланировано;
			НовыйИсполнитель.Пояснение         = Параметры.ВидЗадачи.Наименование;
		КонецЦикла;
	Иначе
		Возврат;
	КонецЕсли;
	
	Задача.Записать();
	
КонецПроцедуры

//подписка на событие Renault_ЗадачиОФУ. Запись заявок на кредит и на страховку 
Процедура Renault_ЗадачиОФУПриЗаписи(Источник, Отказ) Экспорт
     	
	Если Источник.ОбменДанными.Загрузка Тогда 		
		Возврат;  		
	КонецЕсли;
	
	Задачи.Renault_События.ВыполнитьЗадачу(Источник.Задача, ПараметрыСеанса.Пользователь);
	
КонецПроцедуры

//подписка на событие Renault_ЗадачиКСО. Запись заявок на кредит и на страховку 
Процедура Renault_ЗадачиКСОПриЗаписи(Источник, Отказ) Экспорт
	
	Задачи.Renault_События.ВыполнитьЗадачу(Источник.Задача, ПараметрыСеанса.Пользователь);
	
КонецПроцедуры
